--- a/End-to-End-Tests.md
+++ b/End-to-End-Tests.md
@@ -104,24 +85,16 @@ Finally, flakes mean that developers rerun failing tests more readily. We even i
 
 Conceptually, preventing flakes is easy. We can use `waitFor` statements to make the tests deterministic despite testing a non-deterministic system. For example, suppose we have a function `waitForModal()` that waits for a modal to appear. Then we could write our test like this:
-
-```text
-               <---A--->
-
-                        +-------+
-                        | Modal |
-+----------+   +---//---+ opens +---------------------------------+
-| Click to |   |        +-------+                                 |
-| open     +---+                                                  +---->
-| modal    |   |        +----------------+    +-------------+     |
-+----------+   +---//---+ waitForModal() +-//-+ Click to    +-----+
-                        +----------------+    | close modal |
-                                              +-------------+
-
-               <---B---><-------C-------->
-
-
---------------------- time -------------------------------------------->
+```mermaid
+flowchart LR
+a("<--A-->")
+COM("Clickto open modal") ---- |"//"| MO("Modal opens")
+COM ----|"//"| WM("waitForModal") ---- |"//"| CCM("Click to close modal")
+MO ---- P("+")
+CCM ---- P
+P ----> O("Operations continue")
+BC("<--B--><-------C------->")
+starts ----time-----> ends
 ```
 
 Now, we know that the test code won't move past `waitForModal()` until after the modal opens. In other words, we know that `B + C > A`. This assures us that the test won't try to close the modal until after the modal has opened.
